Tekla Open API Reference for Tekla Structures 2025
Phase Constructor
Overload List
Name | Description
Phase()
 Instantiates a new phase with the phase number 0.
Phase(Int32)
 Instantiates a new phase with the given phase number.
Phase(Int32, String, String, Int32)
 Instantiates a new phase with the given parameters.
Top
See Also
Reference
Phase Class
Tekla.Structures.Model Namespace